In [1]:
%load_ext sql
%sql postgresql://postgres:RKhM7ewvU7quDC@localhost:5432/dme_m03

In [3]:
%%sql
SELECT table_name FROM information_schema.tables WHERE table_schema='public';

 * postgresql://postgres:***@localhost:5432/dme_m03
8 rows affected.

[('employee',),
 ('facility',),
 ('location',),
 ('customer',),
 ('eventrequest',),
 ('eventplan',),
 ('eventplanline',),
 ('resourcetbl',)]

## 1. List the city, state, and zip codes in the customer table.  Your result should not have duplicates.

In [9]:
%%sql
SELECT DISTINCT city, state, zip 
FROM customer;

 * postgresql://postgres:***@localhost:5432/dme_m03
2 rows affected.

[('Louisville', 'CO', '80027'), ('Boulder', 'CO', '80309')]

## 2. List the name, department, phone number, and email address of employees with a phone number beginning with “3-”.

In [15]:
%%sql

SELECT empname, department, phone, email 
FROM employee 
WHERE phone LIKE '3-%';

 * postgresql://postgres:***@localhost:5432/dme_m03
3 rows affected.

[('Chuck Coordinator', 'Administration', '3-1111', 'chuck@colorado.edu'),
 ('Sally Supervisor', 'Planning', '3-2222', 'sally@colorado.edu'),
 ('Alan Administrator', 'Administration', '3-3333', 'alan@colorado.edu')]

## 3. List all columns of the resource table with a rate between $10 and $20. Sort the result by rate.

In [19]:
%%sql

SELECT * 
FROM resourcetbl 
WHERE rate 
BETWEEN 10 AND 20 
ORDER BY rate;

 * postgresql://postgres:***@localhost:5432/dme_m03
6 rows affected.

[('R100', 'attendant', 10),
 ('R102', 'usher', 10),
 ('R105', 'food service', 10),
 ('R101', 'police', 15),
 ('R104', 'janitor', 15),
 ('R103', 'nurse', 20)]

## 4. List the event requests with a status of “Approved” or “Denied” and an authorized date in July 2018. Include the event number, authorization date, and status in the output.

In [36]:
%%sql

SELECT eventno, dateauth, status 
FROM eventrequest
WHERE 
    (status='Approved' or status='Denied') 
    AND 
    (dateauth BETWEEN '2018-07-01' AND '2018-07-31');

 * postgresql://postgres:***@localhost:5432/dme_m03
4 rows affected.

[('E102', datetime.date(2018, 7, 31), 'Approved'),
 ('E104', datetime.date(2018, 7, 31), 'Approved'),
 ('E106', datetime.date(2018, 7, 31), 'Approved'),
 ('E107', datetime.date(2018, 7, 31), 'Denied')]

## 5. List the location number and name of locations that are part of the “Basketball arena”.  Your WHERE clause should not have a condition involving the facility number compared to a constant (“F101”). Instead, you should use a condition on the FacName column for the value of “Basketball arena”.

In [26]:
%%sql

SELECT locno, locname 
FROM location 
INNER JOIN facility ON location.facno = facility.facno 
WHERE facname = 'Basketball arena';

 * postgresql://postgres:***@localhost:5432/dme_m03
2 rows affected.

[('L103', 'Locker room'), ('L105', 'Gate')]

In [34]:
%%sql

SELECT planno, 
COUNT(*) AS count_planline, 
SUM(numberfld) AS sum_numberfld 
FROM eventplanline 
GROUP BY planno;

 * postgresql://postgres:***@localhost:5432/dme_m03
10 rows affected.

[('P95', 5, 16),
 ('P105', 2, 8),
 ('P102', 3, 8),
 ('P349', 1, 1),
 ('P103', 3, 8),
 ('P85', 3, 10),
 ('P104', 2, 8),
 ('P100', 4, 7),
 ('P199', 1, 1),
 ('P101', 3, 8)]